---
type: WaterLoopData
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 5
tags: [revit-api, class]
---

# WaterLoopData

`Autodesk.Revit.DB.Mechanical.WaterLoopData` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | ChillerType | 2020.1 | `public WaterChillerType ChillerType { get ; set ; }` |
| Property | CondenserWaterLoopId | 2020.1 | `public ElementId CondenserWaterLoopId { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | WaterLoopType | 2020.1 | `public WaterLoopType WaterLoopType { get ; set ; }` |